In [2]:
%run "../../../common/0_notebooks_base_setup.py"

C:\Users\anabella\Documents\DH\Actividades\clase_05\dsad_2021\common
default checking
Running command `conda list`... ok
jupyterlab=2.2.6 already installed
pandas=1.1.5 already installed
bokeh=2.2.3 already installed
seaborn=0.11.0 already installed
matplotlib=3.3.2 already installed
ipywidgets=7.5.1 already installed
pytest=6.2.1 already installed
chardet=4.0.0 already installed
psutil=5.7.2 already installed
scipy=1.5.2 already installed
statsmodels=0.12.1 already installed
scikit-learn=0.23.2 already installed
xlrd=2.0.1 already installed
Running command `conda install --yes nltk=3.5.0`... ok
Collecting package metadata (current_repodata.json): ...working... done
Solving environment: ...working... done

# All requested packages already installed.


unidecode=1.1.1 already installed
pydotplus=2.0.2 already installed
pandas-datareader=0.9.0 already installed
flask=1.1.2 already installed

---

<img src='../../../common/logo_DH.png' align='left' width=35%/>

## Dataset

En la práctica de la clase de hoy usaremos una versión muy resumida de datos de la Encuesta Permanentes de Hogares (relevamiento llevado adelante por el INDEC). Se trata de una encuesta continua que tiene como objetivo fundamental generar información sobre el funcionamiento del mercado de trabajo.

Solamente utilizaremos algunas variables (edad, nivel educativo, cantidad de horas trabajadas, calificación de la tarea e ingreso laboral) y algunos casos (los ocupados, es decir, aquellos que han trabajado al menos una hora en la semana anterior al relevamiento).

Importamos la biblioteca pandas y asignamos pd como alias:

In [58]:
import pandas as pd
import numpy as np

## Ejercicio 1

Vamos a leer los datos del archivo /M1/CLASE_04/Data/data_filt.csv en un `DataFrame` de pandas con el método `read_csv`

https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.read_csv.html


Este archivo tiene algunos datos numéricos y otros de tipo cadena de caracteres. 

Las columnas son:

"ch06","nivel_ed","htot","calif","p47t"

* ch06: int, edad

* nivel_ed: string, nivel educativo

* htot: int, cantidad de horas totales trabajadas en el período

* calif: string, calificación de la tarea

* p47t: int, ingreso

In [6]:
data_location = "../Data/data_filt.csv"
data = pd.read_csv(data_location, sep=",", encoding="latin1")
data

       ch06           nivel_ed  htot            calif     p47t
0        46        1_H/Sec inc    45  2_Op./No calif.   6000.0
1        26  2_Sec. comp y más    25  2_Op./No calif.   5000.0
2        47  2_Sec. comp y más    25  2_Op./No calif.   5000.0
3        52        1_H/Sec inc    90  2_Op./No calif.  11000.0
4        45        1_H/Sec inc    44  2_Op./No calif.   9500.0
...     ...                ...   ...              ...      ...
23443    45  2_Sec. comp y más    50  2_Op./No calif.   4000.0
23444    58        1_H/Sec inc    30  2_Op./No calif.   5000.0
23445    36  2_Sec. comp y más    40  2_Op./No calif.  13000.0
23446    49        1_H/Sec inc    40  2_Op./No calif.   4000.0
23447    36        1_H/Sec inc    54  2_Op./No calif.   8000.0

[23448 rows x 5 columns]

## Ejercicio 2

Miremos ahora los primeros tres registros del `DataFrame` data, y los ultimos cinco registros.

¿Cuántas filas tiene data? ¿Y cuántas columnas?

Ayudas:

https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.head.html?highlight=head#pandas.DataFrame.head

https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.tail.html?highlight=tail#pandas.DataFrame.tail

https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.shape.html?highlight=shape#pandas.DataFrame.shape

https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.info.html?highlight=info

In [5]:
data.head(3)

   ch06           nivel_ed  htot            calif    p47t
0    46        1_H/Sec inc    45  2_Op./No calif.  6000.0
1    26  2_Sec. comp y más    25  2_Op./No calif.  5000.0
2    47  2_Sec. comp y más    25  2_Op./No calif.  5000.0

In [8]:
data.tail()

       ch06           nivel_ed  htot            calif     p47t
23443    45  2_Sec. comp y más    50  2_Op./No calif.   4000.0
23444    58        1_H/Sec inc    30  2_Op./No calif.   5000.0
23445    36  2_Sec. comp y más    40  2_Op./No calif.  13000.0
23446    49        1_H/Sec inc    40  2_Op./No calif.   4000.0
23447    36        1_H/Sec inc    54  2_Op./No calif.   8000.0

In [12]:
data.index.size

23448

In [10]:
data.columns.size

5

In [17]:
# También podemos usar el método shape que devuelve una tupla con las dimensiones de la matriz
data.shape
print("El número de filas es de", data.shape[0], "y el número de columnas es de", data.shape[1])

El número de filas es de 23448 y el número de columnas es de 5

## Ejercicio 3

¿Cuáles son los nombres de las columnas del `DataFrame` data?

¿Cuál es el índice del `DataFrame` data?

Ayudas:

https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.columns.html?highlight=columns#pandas.DataFrame.columns

https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.index.html?highlight=index#pandas.DataFrame.index

In [18]:
data.columns

Index(['ch06', 'nivel_ed', 'htot', 'calif', 'p47t'], dtype='object')

In [19]:
data.index

RangeIndex(start=0, stop=23448, step=1)

Renombremos ahora los columnas para que queden con estos valores:

['edad', 'nivel_educativo', 'hs_trabajados', 'calif_ocupacional', 'ingreso_ult_mes']

In [22]:
data.columns = ['edad', 'nivel_educativo', 'hs_trabajados', 'calif_ocupacional', 'ingreso_ult_mes']
data

,edad,nivel_educativo,hs_trabajados,calif_ocupacional,ingreso_ult_mes
0,46,1_H/Sec inc,45,2_Op./No calif.,6000.0
1,26,2_Sec. comp y más,25,2_Op./No calif.,5000.0
2,47,2_Sec. comp y más,25,2_Op./No calif.,5000.0
3,52,1_H/Sec inc,90,2_Op./No calif.,11000.0
4,45,1_H/Sec inc,44,2_Op./No calif.,9500.0
...,...,...,...,...,...
23443,45,2_Sec. comp y más,50,2_Op./No calif.,4000.0
23444,58,1_H/Sec inc,30,2_Op./No calif.,5000.0
23445,36,2_Sec. comp y más,40,2_Op./No calif.,13000.0
23446,49,1_H/Sec inc,40,2_Op./No calif.,4000.0
23447,36,1_H/Sec inc,54,2_Op./No calif.,8000.0

## Ejercicio 4 

¿Cuál es el tipo de datos de la cuarta columna de data?

In [32]:
data.iloc[:,3].dtype

dtype('O')

## Ejercicio 5 

¿Cómo están distribuidos los niveles educativos? ¿Cuál es el más común?

Ayuda:

https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.Series.value_counts.html?highlight=value_counts#pandas.Series.value_counts

In [39]:
data.nivel_educativo.unique()

array(['1_H/Sec inc', '2_Sec. comp y más'], dtype=object)

In [101]:
sec_inc = data[data.nivel_educativo == '1_H/Sec inc'].shape[0]
sec_comp = data[data.nivel_educativo == '2_Sec. comp y más'].shape[0]
all_registers = data.shape[0]
print("El porcentaje de personas con educación secundaria incompleta es del", np.around(sec_inc*100/all_registers, 2), "%. Y el porcentaje de personas con educación secundaria completa y más estudios es del", np.around(sec_comp*100/all_registers, 2), "%")

El porcentaje de personas con educación secundaria incompleta es del 37.59 %. Y el porcentaje de personas con educación secundaria completa y más estudios es del 62.41 %

In [102]:
sec_inc, sec_comp

(8814, 14634)

In [103]:
# Con value_counts() podemos ver la proporción entre las clases directamente.
df_ed = data["nivel_educativo"]
df_ed.value_counts()

2_Sec. comp y más    14634
1_H/Sec inc           8814
Name: nivel_educativo, dtype: int64

In [133]:
df_ed.value_counts().max()

14634

In [134]:
# Busco el index que tenga el mayor valor 
print("El nivel de educación más común es:", df_ed.value_counts().index[0])

El nivel de educación más común es: 2_Sec. comp y más

## Ejercicio 6

¿Cuál es el ingreso medio de la población?

In [67]:
mean_salary = np.around(np.mean(data.loc[:,"ingreso_ult_mes"]), 2)
print( "$", mean_salary)

$ 8107.91

## Ejercicio 7

Construyamos un objeto `DataFrame` con las columnas nivel_educativo e ingreso_ult_mes de data

Seleccionemos las primeras 20 filas de este objeto `DataFrame`

Seleccionemos una muestra aleatoria de 500 filas de este objeto `DataFrame`

Ayuda:

https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.sample.html?highlight=sample#pandas.DataFrame.sample

In [69]:
ed_salary = data.loc[:, ["nivel_educativo", "ingreso_ult_mes"]]
ed_salary.head(20)

      nivel_educativo  ingreso_ult_mes
0         1_H/Sec inc           6000.0
1   2_Sec. comp y más           5000.0
2   2_Sec. comp y más           5000.0
3         1_H/Sec inc          11000.0
4         1_H/Sec inc           9500.0
5   2_Sec. comp y más           6000.0
6   2_Sec. comp y más           9000.0
7         1_H/Sec inc           4260.0
8         1_H/Sec inc           3800.0
9   2_Sec. comp y más          10517.0
10        1_H/Sec inc           8300.0
11  2_Sec. comp y más           4900.0
12  2_Sec. comp y más          11000.0
13  2_Sec. comp y más           9000.0
14        1_H/Sec inc           3500.0
15        1_H/Sec inc           8000.0
16        1_H/Sec inc           2500.0
17        1_H/Sec inc           7500.0
18        1_H/Sec inc           5000.0
19        1_H/Sec inc           5500.0

In [70]:
ed_salary.sample(500)

         nivel_educativo  ingreso_ult_mes
19418        1_H/Sec inc          12000.0
4650   2_Sec. comp y más          37000.0
14847  2_Sec. comp y más           5250.0
19543        1_H/Sec inc           4800.0
11793  2_Sec. comp y más           8000.0
...                  ...              ...
22571        1_H/Sec inc           5000.0
21002  2_Sec. comp y más           8000.0
8065   2_Sec. comp y más           7000.0
18758  2_Sec. comp y más          14000.0
1329         1_H/Sec inc           7000.0

[500 rows x 2 columns]

## Ejercicio 8

Construyamos un objeto `DataFrame` con todas las columnas de data excluyendo nivel_educativo.

Ayuda: 

Construir una máscara booleana de los nombres de las columnas.

In [123]:
dropped_ed = data.columns != "nivel_educativo"
data = data.loc[:, dropped_ed]
data

       edad  hs_trabajados calif_ocupacional  ingreso_ult_mes
22574    93             20   2_Op./No calif.           8000.0
16954    85             36   2_Op./No calif.           8250.0
16461    85             40     1_Prof./Tecn.          20700.0
23317    84             25   2_Op./No calif.           9900.0
4340     84             36   2_Op./No calif.           7500.0
...     ...            ...               ...              ...
14556    13             14   2_Op./No calif.            800.0
20050    12             20   2_Op./No calif.           1600.0
19856    12             15   2_Op./No calif.           1200.0
5698     12              5   2_Op./No calif.            250.0
15308    12              7   2_Op./No calif.            250.0

[23448 rows x 4 columns]

## Ejercicio 9

Ordenar data según la columna edad en forma decreciente.

Ayuda: 

https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.sort_values.html?highlight=sort_values#pandas.DataFrame.sort_values

In [74]:
data = data.sort_values("edad", ascending=False)
data

,edad,nivel_educativo,hs_trabajados,calif_ocupacional,ingreso_ult_mes
22574,93,1_H/Sec inc,20,2_Op./No calif.,8000.0
16954,85,2_Sec. comp y más,36,2_Op./No calif.,8250.0
16461,85,2_Sec. comp y más,40,1_Prof./Tecn.,20700.0
23317,84,1_H/Sec inc,25,2_Op./No calif.,9900.0
4340,84,1_H/Sec inc,36,2_Op./No calif.,7500.0
...,...,...,...,...,...
14556,13,1_H/Sec inc,14,2_Op./No calif.,800.0
20050,12,1_H/Sec inc,20,2_Op./No calif.,1600.0
19856,12,1_H/Sec inc,15,2_Op./No calif.,1200.0
5698,12,1_H/Sec inc,5,2_Op./No calif.,250.0
15308,12,1_H/Sec inc,7,2_Op./No calif.,250.0

## Ejercicio 10

¿Cuál es el promedio de horas trabajadas de los jóvenes entre 14 y 25 años y poco calificados?

Ayuda:
    
Combina varias máscaras booleanas

In [75]:
data.calif_ocupacional.unique()

array(['2_Op./No calif.', '1_Prof./Tecn.'], dtype=object)

In [85]:
df_14_25_low_calif = data[(data.calif_ocupacional == '2_Op./No calif.') & ((data.edad >=14) & (data.edad <=25))]
print("Horas promedio trabajadas de los jóvenes entre 14 y 25 años y poco calificados:", np.int(np.mean(df_14_25_low_calif.hs_trabajados)))

Horas promedio trabajadas de los jóvenes entre 14 y 25 años y poco calificados: 37

## Ejercicio 11

Generemos un nuevo dataframe con los trabajadores que ganan más del promedio de ingresos general y están por debajo de la cantidad media de horas trabajadas. ¿Cuántos trabajadores se encuentran en esta condición? ¿Cuál es su edad mediana?

Ayuda:

Calcular el promedio de ingresos y la media de horas trabajadas

Construir máscaras booleanas con estos valores

Indexar data con la combinación de las máscaras construidas

In [91]:
mean_salary

8107.91

In [135]:
mean_hours = np.around(np.mean(data.loc[:, "hs_trabajados"]), 2)
mean_hours

39.68

In [136]:
high_salary_low_hours = data[(data.ingreso_ult_mes > mean_salary) & (data.hs_trabajados < mean_hours)]
high_salary_low_hours

       edad  hs_trabajados calif_ocupacional  ingreso_ult_mes
16954    85             36   2_Op./No calif.           8250.0
23317    84             25   2_Op./No calif.           9900.0
5343     82             33     1_Prof./Tecn.          12300.0
20213    82             30   2_Op./No calif.          23800.0
17363    82             12   2_Op./No calif.           8500.0
...     ...            ...               ...              ...
6751     19             39   2_Op./No calif.           9600.0
1395     19             20     1_Prof./Tecn.          12500.0
3348     19             16   2_Op./No calif.          12000.0
19871    18             16   2_Op./No calif.          13000.0
152      18             36     1_Prof./Tecn.          19800.0

[2132 rows x 4 columns]

In [137]:
print("La cantidad de trabajadores en esta situación es de", high_salary_low_hours.shape[0])

La cantidad de trabajadores en esta situación es de 2132

In [138]:
median_age_hs_lh = np.int(np.median(high_salary_low_hours.edad))
print("La edad mediana de este grupo es de", median_age_hs_lh)

La edad mediana de este grupo es de 44